// Під час розв’язку задач 4 та 5 потрібно використати явну ініціалізацію
// елементів масиву.
// 5. Дано масив розміру N. Знайти номери тих елементів масиву, які більше свого
// лівого сусіда, і кількість таких елементів. Знайдені номера виводити в порядку
// їх зменшення.

#include <iostream>
using namespace std;
#define N 7
int main(){
    int count = 0;
    int arr[N] = {5, 7, 3, 9, 12, 8, 15};
    for (int i = N-1; i > 0; i--)
    {
        if (arr[i]>arr[i-1])
        {
            cout << i+1 <<", ";
            count++;
        }
    }
    cout << endl << count;
    
}