// Під час розв’язку задач 4 та 5 потрібно використати явну ініціалізацію
// елементів масиву.
// 4. Дано масив ненульових цілих чисел розміру N. Перевірити, чи утворюють
// його елементи геометричну прогресію. Якщо утворюють, то вивести
// знаменник прогресії, якщо ні – вивести 0.

#include <iostream>
using namespace std;
#define N 5
int main(){
    int arr[N] = {2, 6, 18, 54, 162};
    int q = arr[1] / arr[0];
    bool isGP = true;
    for(int i = 1; i < N; i++){
        if (arr[i-1]*q != arr[i])
        {
            isGP = false;
            break;
        }
    }
    (isGP)?cout<<q:cout<<0;
}